In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
var_num = df.select_dtypes(include='number').columns
var_cat = df.select_dtypes(exclude='number').columns
var_num

Index(['total_bill', 'tip', 'size'], dtype='object')

In [4]:
for i in var_num:
    print(f'{i.upper()} mean: {df[i].mean()}\t meadian: {df[i].median()}\t mode: {df[i].mode()}')

TOTAL_BILL mean: 19.785942622950824	 meadian: 17.795	 mode: 0    13.42
dtype: float64
TIP mean: 2.9982786885245902	 meadian: 2.9	 mode: 0    2.0
dtype: float64
SIZE mean: 2.569672131147541	 meadian: 2.0	 mode: 0    2
dtype: int64

In [5]:
df[var_cat].describe()

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

In [6]:
df.mode()

   total_bill  tip   sex smoker  day    time  size
0       13.42  2.0  Male     No  Sat  Dinner     2

In [7]:
import scipy.stats as stats
stats.mode(df)

ModeResult(mode=array([[13.42, 2.0, 'Male', 'No', 'Sat', 'Dinner', 2]], dtype=object), count=array([[  3,  33, 157, 151,  87, 176, 156]]))

In [8]:
df['total_bill'].min(), df['total_bill'].max(), df['total_bill'].quantile(.7)

(3.07, 50.81, 22.508)